In [13]:
import pymysql
pymysql.install_as_MySQLdb()

In [14]:
from sqlalchemy import create_engine

In [24]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Navnoor007" # (or whatever password you chose during mysql installation)
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [25]:
engine = create_engine(connection)

In [26]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [28]:
import pandas as pd
q = """
SELECT first_name, last_name, address_id, email, city_id
FROM customer
JOIN city
ON customer.customer_id = city.city_id
WHERE city_id = 312;
"""

pd.read_sql(q,engine)

  first_name last_name  address_id                             email  city_id
0       MARK  RINEHART         317  MARK.RINEHART@sakilacustomer.org      312

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [29]:
q = """
SELECT title, description, release_year, rating, special_features
FROM film as f
JOIN category as c
ON f.film_id = c.category_id
WHERE name = 'comedy';
"""

pd.read_sql(q,engine)

,title,description,release_year,rating,special_features
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [30]:
q = """
SELECT last_name, title, release_year
FROM film
JOIN actor
ON film.film_id = actor.actor_id
WHERE last_name = 'Lollobrigida';
"""

pd.read_sql(q,engine)

      last_name        title  release_year
0  LOLLOBRIGIDA  AFRICAN EGG          2006

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [31]:
q = """
SELECT last_name, first_name, title
FROM actor as a
LEFT JOIN film as f
ON a.actor_id = f.film_id
WHERE title = "Bingo Talented";
"""

pd.read_sql(q,engine)

  last_name first_name           title
0      PENN       GARY  BINGO TALENTED

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [35]:
q = """
SELECT p.customer_id, p.amount, (SELECT 2*AVG(amount) FROM payment) AS twice_avg_amount
FROM payment as p
WHERE p.amount > (SELECT 2*AVG(amount) FROM payment);
"""

pd.read_sql(q,engine)

     customer_id  amount  twice_avg_amount
0              1    9.99          8.401335
1              2   10.99          8.401335
2              3    8.99          8.401335
3              3   10.99          8.401335
4              3    8.99          8.401335
..           ...     ...               ...
852          595    9.99          8.401335
853          595   10.99          8.401335
854          597    8.99          8.401335
855          599    9.99          8.401335
856          599    8.99          8.401335

[857 rows x 3 columns]

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [37]:
q = """
SELECT c.first_name, c.last_name, (SELECT COUNT(payment_id) FROM payment) AS num_payment
FROM payment as p
JOIN customer as c
ON p.customer_id = c.customer_id
ORDER BY 3
LIMIT 5;
"""

pd.read_sql(q,engine)

  first_name last_name  num_payment
0       MARY     SMITH        16049
1       MARY     SMITH        16049
2       MARY     SMITH        16049
3       MARY     SMITH        16049
4       MARY     SMITH        16049